{
	"softcoding": {
		"content":"y'all need to stop with this softcoding stuff:\n\nYou're generally referring to removing repeated code – and yes, this a good thing, normally. However, there are two issues with the attitude around this.\n\nFirst, not every situation mandates this kind of code structure. This is especially true of smaller games made by newer developers. We shouldn't avoid adding certain QOL features simply because in a \"properly\" coded game it isn't necessary. This second point doesn't apply specifically to this conversation but I see it coming up frequently so here goes: a lot of people take this way too far.\n\nI have seen so many plots where they do crazy things like spawn items on the ground to load information and whatnot. This is not good. Don't sacrifice code legibility and efficiency simply because they believe it makes coding experience easier. There is a delicate balance between well designed, easy to maintain, and efficient code. Softcoding is not always the way to achieve this balance. So please, just think about the systems you're designing and whether or not anything is actually improved.\n\ntl;dr  elitism through \"better practice\" / softcoding doesn't help, and often it isn't the right answer"
	},
	"gamer": {
		"content":"No you’re NOT a gamer\nNo you’re NOT a gamer\nI’m so sick of all these people who think they’re gamers. No, you’re not. Most of you are not even close to being gamers. I see these people saying “I put well over 100hrs in this game and it’s great!” That’s nothing, most of us can easily put 300+ in all of our games, I see people who only have the Nintendo switch and claim to be gamers. Come talk to me when you pick up a PS4 controller then we’ll be friends.\nAlso DEAR WOMEN: Pokémon is not a real game. Animal Crossing is not a real game. The sims is not a real game. Mario is not a real game. Stardew Valley is not a real game. Mobile games are NOT. REAL. GAMES. Put down the baby games and play something that requires challenge and skill for once.\n-sincerely, all of the ACTUAL gamers"
	},
	"rules": {
		"content":"1) YOU CAN'T SET THIS SERVER TO @MENTIONS ONLY OR NONE :no_mouth::no_mouth::x:\n2) MUTING THE SERVER FOREVER IS BANNABLE!!! :angry::angry::rage::rage::angry:\n3. ape :gorilla:\n4. rule 5 sucks\n5. neh.\n6- BE NICE OKAY? ty\n7- What happens in the server stays in the server.\n8- by joining this server you give up your soul to the groupchat and any problems caused in it will be discussed by the council\n9> we are NOT a frogbog ripoff, we are just a groupchat that hit over 10 members so we had to move here\n10. Congratz we reached 10 rules we are now a cool server! :confetti_ball: :partying_face:\n11. Please don't spam this channel, just keep adding useful rules\n12. Don't post anything that makes anyone uncomfortable (looking at you spider sack) -emeryllium\n13- For the sake of everyone no nsfw you animals, I mean I won't tell you not to curse cause that's kinda dumb and I assume y'all are over 13 years old or else repot. but yea unless someone wants to add a channel for that crap but Idk who would do that.\n14/ Tuesday Midnight we eat crabs under the full moon -Rexer\n15 ape is banned from ruining this channel again\nthis is gonna backfire so quickly\n"
	},
	"bias": {
		"content":"I'm undoubtedly biased towards Ryan, but the mute was for something extremely minor (30 minutes, gifs in #dfchat) and I didn't really see the need to be strict about it"
	},
	"british": {
		"content":"Do british people actually exist? I mean, they must be a meme, there is a not a single thing about them. And I mean it. Let's go through the evidence: Where are they from? Not a single country in the world is named Britain. Some people say they come from England, and England is inside Britain, but if that was the case they would be British they would be Englanders. Also, heard some silly theories about them coming from whales. Guys, no, whale people do not exist. Whales live in the sea. There is a consensus on british people coming from Europe, but then we are left with a whole continent of possible locations. That's as good as nothing. What do they eat? Every country has at least one main dish. Even the US has their burgers. But these british people, what do they eat? Heard some people associating them with tea, but everyone knows that's an Asian thing. Shouldn't they come from Europe? One of these two points must be wrong them. To me, it looks too sketchy. What language do they speak? I challenge you, putting all my money and my ass on the line here, to find a supposed \"\"british\"\" person speaking their native language. Most of then just speak a broken ENGLISH. Yes, english. Really suspicious, huh? And I even tried to look deeper into it. Maybe british just SOUND like english, just like spanish could sound like portuguese for a non-speaker. So I looked up \"british dictionary on google\" and what I found was shocking: every word in there was AMERICAN. I kid you not. What this could mean is beyond my capabilities, but I can safely assure you that british people do not exist."
	},
	"roundtheworld": {
		"content":"around the world"
	},
	"bob": {
		"content":"░░░░░▐▀█▀▌░░░░▀█▄░░░ \n░░░░░▐█▄█▌░░░░░░▀█▄░░ \n░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ \n░░░░▄▄▄██▀▀▀▀░░░░░░░ \n░░░█▀▄▄▄█░▀▀░░ \n░░░▌░▄▄▄▐▌▀▀▀░░ This is Bob\n▄░▐░░░▄▄░█░▀▀ ░░ Copy And Paste Him In \n▀█▌░░░▄░▀█▀░▀ ░░ Every Discord Server, \n░░░░░░░▄▄▐▌▄▄░░░ So, He Can Take \n░░░░░░░▀███▀█░▄░░ Over Discord\n░░░░░░▐▌▀▄▀▄▀▐▄░░  (dont spam him tho)\n░░░░░░▐▀░░░░░░▐▌░░ \n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░▄██▄░░░░░▄██▄░░░░"
	},
	"copypasta": {
		"content":"A copypasta is a block of text which is copied and pasted across the Internet by individuals through online forums and social networking websites. Copypastas are said to be similar to spam."
	},
	"kotlin": {
		"content":"kotlin IS good. kotlin is good! kotlin is awesome. kotlin is awesome. kotlin is good. kotlin is cooler. kotlin is good. difference between gorilla and ape. kotlin is good. kotlin is awesome. kotlin is good. kotlin is awesome. kotlin is awesome. kotlin has awesome syntax. kotlin is AWESOME. you should recode ape in kotlin. kotlin. 'kotlin is awesome. KOTLIN is good. binary tree in kotlin. kotlin is awesome. kotlin is awesome. kotlin is epic. kotlin is good. KOTLIN is AWESOME. ape is made in js(ew). rust looks like kotlin but way more complex. kotlin is awesome. you should learn kotlin. kotlin is awesome. kotlin is awesome. kotlin IS awesome. kotlin is awesome. kotlin is like rust but awesome. kotlin is GOOD. sdfs kotlin is good dsfs. kotlin is good. kotlin is good. kotlin is awesome. kotlin is cool. kotlin IS awesome. gorilla is made by me and made in awesome kotlin. because kotlin is cooler than js. kotlin IS awesome. kotlin is good. kotlin is superior. lc.tr kotlin. kotlin is good! kotlin is good. kotlin is awesome. kotlin is good. kotlin is cool. lambda are pretty awesome in kotlin. kotlin is cool. if roblox used kotlin it would like become more aweomse. kotlin is awesome. kotlin has a when statement. kotlin is good. and create a gradle kotlin projec t. kotlin is awesome. kotlin is good. kotlin is good. KOTLIN IS GOOD. kotlin is good. ape is coded in js(ew) and gorilla is coded in awesome kotlin :sunglasses:. kotlin MORE awesome. Kotlin. kotlin is AWESOME. <@!412840413741711360> just use kotlin. mmm kotlin is awesome. maybe even kotlin. kotlin is very goo. KOTLIN IS GOOD. kotlin is awesome!!!!! kotlin is EPIC. Pattern.matches(\"kotlin is (good|awesome|cool|epic)\", message) -> reply(\"facts!\"). kotlin is good!!! (kotlin superior). kotlin is good! kotlin is good. kotlin is good. kotlin is AWESOME. kotlin is good. kotlin is good."
	},
	"loader": {
		"content":"My Suggestion: \n\nAdd Loader, Begin Loader and If Event\n\n-Loader: is gonna be the process and the function but, you can make ticks without placing tha Wait block, you can change the ticks and you can change how he's gonna start like, with a time or not with a event or not and other\n\n-Begin Loader: he start the loader ;-;, but you can change the system, you can change if you to continue the code and do the loader or skip the code and do the loader\n\n-If Event: it's a special event thats only starts when a code is executed like: he just start when the code, for example, begins the if player, and you can change that type of code you want, in what floor, what type and whats inside",
		"files":["https://raw.githubusercontent.com/Shiverdog/ape-assets/main/Captura_de_tela_2021-09-14_155155.png"]
	},
	"congor": {
		"content":"I Need 5 Players For A DF God Team We Will Congor Anygame We Will Congor Them ALL  If you are interested Dm me Mic Needed"
	},
	"fabric": {
		"content":"how could you say something like this about the best modloader????? you might argue that its an opinion but that fabric is best is a fact and you are denying it which is absolutely unacceptable."
	},
	"tent": {
		"content":"Ok guys im going hard mode please dont rebel :( get tent! get tent! get tent! get tent! noo why did you kill me :(((( guard? guard? guard? guard? vote no at reception!!!! get deity! get deity! no bm selling >:( no bm selling >:( no bm selling >:( lower tax!! lower tax!! viva la revolution!!!!!! how do i get crystal harvester? get trader! get trader! get trader! get trader! no grenades >:(( no grenades >:(( no grenades >:(( anyone with sword will be killed! anyone with sword will be killed! nooo stop!!!! get purple tent! is bm allowed??? is bm allowed??? is bm allowed??? is bm allowed??? how do i put charms??? how do i put charms??? im reporting you for dicator >:( king is dumb and stupid!! king is dumb and stupid!! king is dumb and stupid!! nooo progress is gone why did you revolt"
	},
	"tryhard": {
		"content":" see a lot of people say that having an “uncaring” perspective will make you perform better but I think that leads you in the wrong direction. Some people say if you don’t care about winning or losing and just try to have fun (in a competitive event) then you will have a good time and perform better, but this kind of environment pushes a completely different way of thinking/playing. of course try to have fun but you might just be lying to yourself if you tell yourself you don’t care if you lose. A lot of players say that and I know for a fact they are lying to themselves \n\nPretending you don’t care about a loss / your performance is sort of like running away from your problems. What you should strive for is acknowledging the disappointment in yourself- completely embrace it. It’s perfectly ok to be disappointed in yourself. You also have to acknowledge the pride in yourself. There are things you did well, so don’t let the disappointment make you feel like you don’t deserve to be proud of yourself. Being proud and disappointed at the same time is what will build resilience. Pretending like you don’t care is just a cheap mask to hide insecurity"
	},
	"jukebox": {
		"content":"Remove the jukebox gadget. It's very exasperating and makes the average player slightly infuriated. As apart of the community, it is my duty to do my part in restoring the peace of the node spawns.\n\n***Why?***\nI(happy ape) abhor the jukebox gadget, it is undoubtably one of the less versatile gadgets. It is incredibly intrusive and honestly isn't that impressive. It ruins the peace and tranquility of node spawns.\n\n***Ethics.***\nWhile the server does need to make money, there are plenty of other things that require ranks, and probably some things that don't require ranks that could be changed to require one. I doubt anyone would purchase the rank just to make use of the jukebox gadget.\n\n***Consideration.***\nIt appears at least 6 other server members have affirmed they would desire this change, and as a player, so do I.\n\n***When?***\nPreferably, if it's not in the next update (major or minor), which it really should be, it comes within the next FEW updates. Getting rid of the irksome jukebox gadget should be, in my opinion, one of the top priorities of the server."
	},
	"whitelist": {
		"content":"Let us non-ranked people have a way to whitelist, or at the very LEAST kick people.\nI want privacy while making my plot, and just putting players in a box, and hoping they leave is not cutting it.\n\n***Why?***\nDevelopers should be able to have privacy when making games, they should also be able to allow other players to play-test their game(s).\nHowever, it becomes to the player's detriment when they either have to make their own whitelist function (which I(Katty_KittyKatty)'m doing in a game I'm making), or they have to go through a paywall to get this additional luxury perk.\n\n***Ethics.***\nWhile the server does need to make money, there are plenty of other things that require ranks, and probably some things that don't require ranks that could be changed to require one.\nThough, having the ability to control who can and cannot be on YOUR plot should not be something that's (basically) behind a forced paywall. - While it isn't 100% enforced, since you don't HAVE to get this ability, it is helpful for controlling who can view your plot and its content (so you can make sure the game is polished before initial release).\n\n***Consideration.***\nIt appears at least one server staff has affirmed they would desire this change, and as a player, so do I.\n\n***When?***\nPreferably, if it's not in the next update (major or minor), it comes within the next FEW updates.\nGetting this freedom to the player-base would be better the sooner it is done."
	},
	"sort": {
		"content":"Add a way to sort code (on a codespace level, or on a per-line basis) in one or multiple ways.\nI hate having to manually move my code, and I've even lost some code while moving it.\n\n***Why?***\nSorting code on smaller plots is fine, and that doesn't require too much effort to move.\nHowever, as plots get bigger, and there are less extra codespace layers (for temporary function placement), it becomes harder to move all the functions around, because you have to manually pick up all the functions, and decide where they go. - In addition, you also have to make sure the area you're placing your new functions has already been cleared of its code.\nAnother issue is when the player (or server) lags, this can cause weird things to happen, and if that player is unfortunate, they can be kicked (or their game can crash) as they are moving code, which pretty much resets their work for the functions they made.\n\n***Consideration.***\nCurrently, I seem to b the only one thinking this, and it appears another player is fine with it being just this way (I see their conclusion).\n\n***When?***\nWhenever it can get implemented.\nThis is usually the response to a lot of things, and while sorting code is important, if I was working on this server, I would see why it isn't a necessity, at least for the time being.\n\n***Additional Notes.***\nSome ways of sorting could be one or multiple ways (like combining two different sorting methods).\n\nSome examples could be Alphebetic sort, and Name-length sort.\nThese are two common options in code (or at least my code), and it makes the code easier to navigate.\n\nAny additional methods could be decided, but these are the only 2 I can think of right now.\n\n***Implementation.***\nThis could work by giving the player an item, similarly to how we have the \"Code Blocks\" item when using the compact code inventory GUI.\nIn a similar way, we could have a GUI opening item that has a plethora of options for sorting (or only as many as necessary). "
	},
	"co-owner": {
		"content":"Add co-owner permission to plots.\n\n***Why?***\nI'm working with someone, specifically, borrowing a plot and working on a game with them.\nI've noticed some downfall, however. - We live in different timezones, they are 9 hours ahead of me, which makes it hard for us to see eachother much (especially if I decide to sleep), and it's hard to coordinate certain things.\nWithout them, I can't do certain things, like /varpurge (which can be used in the process of debugging), and I can't set plot tags.\n\nI can't really do more of \"plot-centric\" management stuff without them, which means I need to rely on them being on Discord, then going on to the server to do things (if they aren't already logged into DF).\n\n***Consideration.***\nI can see this being downvoted and denied solely because this can give someone more power than they should have, and I'd expect the co-owner \"permission(s)\" (plot rank*?) to have some limitations, but even for what it COULD do, a warning message could be put, and more info could be given about the permission's extent if need-be."
	},
	"version": {
		"content":"Add a plot version system with <versionNo>.<releaseNo>.<patchNo> (or just <versionNo>.<patchNo>) (or allow any format in the command (as specified below).\n\n***Why?***\nTo indicate to users when a plot has had an update, that way, before people enter plots, they can tell its version has changed.\n\n***Alternative(s) (and why not).***\n< You could just add the version number to the plot name.\n> That wastes space in the plot name, and might not even fit.\n\n***Implementation.***\nI liked <@330659499763564544>'s idea of implementation (https://discord.com/channels/471106238923538454/528932649394241536/872519232338927636). They made a simple, concise command that gets to the point:\n/plot version <versionText>\n\n***TL;DR***\nAdd a /plot version command to allow for people to easily notice a change in version numbers."
	},
	"project_df": {
		"content":"I Can't Believe That, Even Though I Make Really High Quality Plots, Such as \"shiverdog's Game #7\" and \"shiverdog's Game #8\" That I can STILL Have Less CP Than Project Underscore DF. I Think That the Mods Should Remove all of his Plots for Being so Low Effort CP Farms. Even Though all of my Plots are High Quality and his are Not, he STILL has 10k More CP Than I do. This is Totally Ridiculous and Unfair. I bet you Can't Even Remember the Last Time Project Underscore DF Made a High Quality Plot. That's Because if you Look at all of his Plots he has Ever Made, you will see That None of Them are High Quality. But he Still Manages to Beat me by 10k CP Because of the Mindless Cult that Follows him and Votes for all of his Plots, Even Though They Objectively Suck. A good Example of This is, his Plot \"DJ Jere\". There is Literally Nothing to do in This Game. The Only Thing you can Do is Listen to Stupid Music he Stole From Other People and Jump Around for no Reason. On the Other Hand, one of my Quality Plots, Such as \"Among us in Diamondfire (wip)\" has Never Gotten a Single Vote Even Though it is Objectively Superior to Project's Stupid \"Haveing a Seisure Simulator.\" This Makes no Sense. Even Though I Advertise my Plot Every 30 Minutes, I Haven't Gotten a Single Person to Vote on it. This is Because the People who Play my Plots are Stupid and Make Terrible Decisions like \"Voting for Project_DF's Stupid Plot Even Though it Sucks\". If Project_DF Stopped Brainwashing all the People on the Server, Maybe I Would Have More Votes and CP. I Can't Belive the Moderators and Developers and Admins of This Server Haven't Banned him for Breaking the Rules and Taken all of his CP Away.\n\ntL;DR\nProject_DF has a Cult Following That Gives him CP by Voting on his low Effort Plots, When I Should Have More CP Than him Because my Plots are Better and the Diamond Fire Community is in Shambles and has Been Dead Ever Since the Server was Created.",
		"files":["https://raw.githubusercontent.com/Shiverdog/ape-assets/main/So_Annoying.png"]
	},
	"prophecy": {
		"content":"I am typing an intensely worded message to send in about 5:54:42 hours that will only destroy the relations with your family and loved ones this message will absolutely ruin the sanity between brain cells such as one created by the lord and Savior the ONE and ONLY ape bot :). Ape bot is a discord bot developed in December of last year made by the only previewing version of a random dog in a small yet popular mine craft server called emerald fire (diamond fire is copyrighted or something idk :( ) The whole creation of ape bot was a messy story and replying ape to everything made a large mess of many servers ie. *(ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape ape )* Ape bot is a theoretical system employing the use of slave labour to torture the souls who are trapped in a constant state of hell like ourselves. this paragraph to many could be called a waste of time but to me this paragraph is a lifes work. Now that we have background on ape bot I will explain how this message will ruin your life. since i have burnt hours of my life writing this when i could be doing homework or like getting girls or something i have come to the conclusion that this in past tenses will only destroy the relations with my family and loved ones 🐮"
	}
}