{
	"softcoding": {
		"content":"y'all need to stop with this softcoding stuff:\n\nYou're generally referring to removing repeated code – and yes, this a good thing, normally. However, there are two issues with the attitude around this.\n\nFirst, not every situation mandates this kind of code structure. This is especially true of smaller games made by newer developers. We shouldn't avoid adding certain QOL features simply because in a \"properly\" coded game it isn't necessary. This second point doesn't apply specifically to this conversation but I see it coming up frequently so here goes: a lot of people take this way too far.\n\nI have seen so many plots where they do crazy things like spawn items on the ground to load information and whatnot. This is not good. Don't sacrifice code legibility and efficiency simply because they believe it makes coding experience easier. There is a delicate balance between well designed, easy to maintain, and efficient code. Softcoding is not always the way to achieve this balance. So please, just think about the systems you're designing and whether or not anything is actually improved.\n\ntl;dr  elitism through \"better practice\" / softcoding doesn't help, and often it isn't the right answer"
	},
	"gamer": {
		"content":"No you’re NOT a gamer\nNo you’re NOT a gamer\nI’m so sick of all these people who think they’re gamers. No, you’re not. Most of you are not even close to being gamers. I see these people saying “I put well over 100hrs in this game and it’s great!” That’s nothing, most of us can easily put 300+ in all of our games, I see people who only have the Nintendo switch and claim to be gamers. Come talk to me when you pick up a PS4 controller then we’ll be friends.\nAlso DEAR WOMEN: Pokémon is not a real game. Animal Crossing is not a real game. The sims is not a real game. Mario is not a real game. Stardew Valley is not a real game. Mobile games are NOT. REAL. GAMES. Put down the baby games and play something that requires challenge and skill for once.\n-sincerely, all of the ACTUAL gamers"
	},
	"rules": {
		"content":"1) YOU CAN'T SET THIS SERVER TO @MENTIONS ONLY OR NONE :no_mouth::no_mouth::x:\n2) MUTING THE SERVER FOREVER IS BANNABLE!!! :angry::angry::rage::rage::angry:\n3. ape :gorilla:\n4. rule 5 sucks\n5. neh.\n6- BE NICE OKAY? ty\n7- What happens in the server stays in the server.\n8- by joining this server you give up your soul to the groupchat and any problems caused in it will be discussed by the council\n9> we are NOT a frogbog ripoff, we are just a groupchat that hit over 10 members so we had to move here\n10. Congratz we reached 10 rules we are now a cool server! :confetti_ball: :partying_face:\n11. Please don't spam this channel, just keep adding useful rules\n12. Don't post anything that makes anyone uncomfortable (looking at you spider sack) -emeryllium\n13- For the sake of everyone no nsfw you animals, I mean I won't tell you not to curse cause that's kinda dumb and I assume y'all are over 13 years old or else repot. but yea unless someone wants to add a channel for that crap but Idk who would do that.\n14/ Tuesday Midnight we eat crabs under the full moon -Rexer\n15 ape is banned from ruining this channel again\nthis is gonna backfire so quickly\n"
	},
	"bias": {
		"content":"I'm undoubtedly biased towards Ryan, but the mute was for something extremely minor (30 minutes, gifs in #dfchat) and I didn't really see the need to be strict about it"
	},
	"british": {
		"content":"Do british people actually exist? I mean, they must be a meme, there is a not a single thing about them. And I mean it. Let's go through the evidence: Where are they from? Not a single country in the world is named Britain. Some people say they come from England, and England is inside Britain, but if that was the case they would be British they would be Englanders. Also, heard some silly theories about them coming from whales. Guys, no, whale people do not exist. Whales live in the sea. There is a consensus on british people coming from Europe, but then we are left with a whole continent of possible locations. That's as good as nothing. What do they eat? Every country has at least one main dish. Even the US has their burgers. But these british people, what do they eat? Heard some people associating them with tea, but everyone knows that's an Asian thing. Shouldn't they come from Europe? One of these two points must be wrong them. To me, it looks too sketchy. What language do they speak? I challenge you, putting all my money and my ass on the line here, to find a supposed \"\"british\"\" person speaking their native language. Most of then just speak a broken ENGLISH. Yes, english. Really suspicious, huh? And I even tried to look deeper into it. Maybe british just SOUND like english, just like spanish could sound like portuguese for a non-speaker. So I looked up \"british dictionary on google\" and what I found was shocking: every word in there was AMERICAN. I kid you not. What this could mean is beyond my capabilities, but I can safely assure you that british people do not exist."
	},
	"roundtheworld": {
		"content":"around the world"
	},
	"bob": {
		"content":"░░░░░▐▀█▀▌░░░░▀█▄░░░ \n░░░░░▐█▄█▌░░░░░░▀█▄░░ \n░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ \n░░░░▄▄▄██▀▀▀▀░░░░░░░ \n░░░█▀▄▄▄█░▀▀░░ \n░░░▌░▄▄▄▐▌▀▀▀░░ This is Bob\n▄░▐░░░▄▄░█░▀▀ ░░ Copy And Paste Him In \n▀█▌░░░▄░▀█▀░▀ ░░ Every Discord Server, \n░░░░░░░▄▄▐▌▄▄░░░ So, He Can Take \n░░░░░░░▀███▀█░▄░░ Over Discord\n░░░░░░▐▌▀▄▀▄▀▐▄░░  (dont spam him tho)\n░░░░░░▐▀░░░░░░▐▌░░ \n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░░░█░░░░░░░░█░░░░░░░\n░░░░▄██▄░░░░░▄██▄░░░░"
	},
	"copypasta": {
		"content":"A copypasta is a block of text which is copied and pasted across the Internet by individuals through online forums and social networking websites. Copypastas are said to be similar to spam."
	},
	"kotlin": {
		"content":"kotlin IS good. kotlin is good! kotlin is awesome. kotlin is awesome. kotlin is good. kotlin is cooler. kotlin is good. difference between gorilla and ape. kotlin is good. kotlin is awesome. kotlin is good. kotlin is awesome. kotlin is awesome. kotlin has awesome syntax. kotlin is AWESOME. you should recode ape in kotlin. kotlin. 'kotlin is awesome. KOTLIN is good. binary tree in kotlin. kotlin is awesome. kotlin is awesome. kotlin is epic. kotlin is good. KOTLIN is AWESOME. ape is made in js(ew). rust looks like kotlin but way more complex. kotlin is awesome. you should learn kotlin. kotlin is awesome. kotlin is awesome. kotlin IS awesome. kotlin is awesome. kotlin is like rust but awesome. kotlin is GOOD. sdfs kotlin is good dsfs. kotlin is good. kotlin is good. kotlin is awesome. kotlin is cool. kotlin IS awesome. gorilla is made by me and made in awesome kotlin. because kotlin is cooler than js. kotlin IS awesome. kotlin is good. kotlin is superior. lc.tr kotlin. kotlin is good! kotlin is good. kotlin is awesome. kotlin is good. kotlin is cool. lambda are pretty awesome in kotlin. kotlin is cool. if roblox used kotlin it would like become more aweomse. kotlin is awesome. kotlin has a when statement. kotlin is good. and create a gradle kotlin projec t. kotlin is awesome. kotlin is good. kotlin is good. KOTLIN IS GOOD. kotlin is good. ape is coded in js(ew) and gorilla is coded in awesome kotlin :sunglasses:. kotlin MORE awesome. Kotlin. kotlin is AWESOME. <@!412840413741711360> just use kotlin. mmm kotlin is awesome. maybe even kotlin. kotlin is very goo. KOTLIN IS GOOD. kotlin is awesome!!!!! kotlin is EPIC. Pattern.matches(\"kotlin is (good|awesome|cool|epic)\", message) -> reply(\"facts!\"). kotlin is good!!! (kotlin superior). kotlin is good! kotlin is good. kotlin is good. kotlin is AWESOME. kotlin is good. kotlin is good."
	},
	"loader": {
		"content":"My Suggestion: \n\nAdd Loader, Begin Loader and If Event\n\n-Loader: is gonna be the process and the function but, you can make ticks without placing tha Wait block, you can change the ticks and you can change how he's gonna start like, with a time or not with a event or not and other\n\n-Begin Loader: he start the loader ;-;, but you can change the system, you can change if you to continue the code and do the loader or skip the code and do the loader\n\n-If Event: it's a special event thats only starts when a code is executed like: he just start when the code, for example, begins the if player, and you can change that type of code you want, in what floor, what type and whats inside"
		"mediaURL":""
	}
}